{
  "Anonymous": {
    "Definition": "Anonymous means something is created without giving it a name. It is often used for temporary objects, types, or functions."
  },
  "Argument": {
    "Definition": "Arguments are the actual values you pass to a method, constructor, or function when you call it. These values get assigned to the corresponding parameters so they can be used wherever they are passed."
  },
  "Concatenation": {
    "Definition": "Concatenation combines two or more values into a single value. It is most commonly used to join strings together."
  },
  "Conditional": {
    "Definition": "Member access that is only allowed when the preceding value is not {c:color-blue keyword}null{/c}. If it is, evaluation of the expression is stopped and returns {c:color-blue keyword}null{/c} immediately. {c:keyword}?.{/c} is also known as the {c:bold}conditional-member access operator{/c}."
  },
  "GenericMethod": {
    "Definition": "A method designed to work with multiple types and must be passed a {c:bold}generic type argument{/c} when invoked. The generic type argument passed in will replace the {c:bold}generic type parameter{/c} defined in the method signature."
  },
  "GenericType": {
    "Definition": "A type that must be supplied a {c:bold}generic type argument{/c} when used. The generic type argument passed in will replace the {c:bold}generic type parameter{/c} in the type definition."
  },
  "ImplicitlyTyped": {
    "Definition": "Implicitly typed means the type is determined automatically by the compiler. The type is still fixed, even though it is not written explicitly."
  },
  "ImportedNamespace": {
    "Definition": "A segment of a {c:bold}using directive{/c} that imports a {c:color-blue keyword}namespace{/c} into the current file. Namespaces are imported to allow their types to be referenced {c:bold}without fully qualified names{/c}."
  },
  "InterpolatedValue": {
    "Definition": "An interpolated value is an expression embedded inside an interpolated string. Its result is inserted into the string at runtime."
  },
  "Nullable": {
    "Definition": "Nullable indicates that a value can also be {c:color-blue keyword}null{/c}. It is used to represent the absence of a value safely."
  },
  "ReturnValue": {
    "Definition": "A return value is the result produced by a method or function. It is sent back to the caller when execution finishes."
  },
  "ShortCircuit": {
    "Definition": "When the left-hand expression determines the result, {c:bold}short circuit{/c} and skip evaluation of the right-hand expression."
  },
  "TypeParameter": {
    "Definition": "A type parameter is a {c:bold}placeholder{/c} that is replaced by a concrete type when a generic type or method is used."
  }
}